tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeYmd(uint32_t ymd) {
    char text[12];
    snprintf(text, sizeof(text), "%04lu-%02lu-%02lu",
             static_cast<unsigned long>(ymd / 10000UL),
             static_cast<unsigned long>((ymd / 100UL) % 100UL),
             static_cast<unsigned long>(ymd % 100UL));
    Esp32BaseWeb::sendChunk(text);
}

void writeMinuteOfDay(uint16_t minuteOfDay) {
    char text[8];
    snprintf(text, sizeof(text), "%02u:%02u", static_cast<unsigned>(minuteOfDay / 60), static_cast<unsigned>(minuteOfDay % 60));
    Esp32BaseWeb::sendChunk(text);
}

void writeSelected(bool selected) {
    if (selected) {
        Esp32BaseWeb::sendChunk(" selected");
    }
}

void writeChecked(bool checked) {
    if (checked) {
        Esp32BaseWeb::sendChunk(" checked");
    }
}

void writeModeOptions(SettingsStore::ExecutionMode selected) {
    Esp32BaseWeb::sendChunk("<option value='simultaneous'");
    writeSelected(selected == SettingsStore::MODE_SIMULTANEOUS);
    Esp32BaseWeb::sendChunk(">同时浇水</option><option value='sequential'");
    writeSelected(selected == SettingsStore::MODE_SEQUENTIAL);
    Esp32BaseWeb::sendChunk(">顺序浇水</option>");
}

uint32_t flowRateLiterPerMinuteX100(uint8_t road) {
    if (road < 1 || road > IrrigationPins::MaxRoads) {
        return 0;
    }
    const SettingsStore::RoadConfig& roadConfig = SettingsStore::current().roads[road - 1];
    if (roadConfig.pulsePerLiter == 0) {
        return 0;
    }
    const uint64_t pulseRateX1000 = FlowMeter::pulseRatePerMinuteX1000(road);
    const uint64_t value = pulseRateX1000 * static_cast<uint64_t>(roadConfig.calibrationX1000) * 100ULL;
    const uint64_t denominator = static_cast<uint64_t>(roadConfig.pulsePerLiter) * 1000ULL * 1000ULL;
    return static_cast<uint32_t>(value / denominator);
}

void writeCss() {
    Esp32BaseWeb::sendChunk(
        "<style>"
        ":root{color-scheme:light;--bg:#f7f8fa;--surface:#fff;--muted:#667085;--text:#17202a;--line:#d8dee6;--soft:#edf0f3;--primary:#146c5f;--ok:#087443;--warn:#a15c07;--danger:#b42318}"
        "*{box-sizing:border-box}body{--page-width:1100px;--page-margin:28px;max-width:none;margin:0;background:var(--bg);color:var(--text);font-size:14px;line-height:1.5;font-family:-apple-system,BlinkMacSystemFont,'Segoe UI','PingFang SC','Microsoft YaHei',sans-serif}.page-overview{--page-width:980px}.page-table{--page-width:1120px;--page-margin:36px}.page-form{--page-width:1040px}.page-settings{--page-width:860px}"
        "a{color:var(--primary);text-decoration:none}a:hover{text-decoration:underline}"
        "body>nav,.footerbar,.info{width:min(var(--page-width),calc(100% - var(--page-margin)));margin-left:auto;margin-right:auto}body>nav{position:sticky;top:0;z-index:2;display:flex;gap:4px;align-items:center;overflow-x:auto;margin-top:0;margin-bottom:14px;padding:9px 10px;background:rgba(255,255,255,.98);border:1px solid var(--line);border-top:0;border-radius:0 0 8px 8px}"
        "body>nav a{display:inline-flex;align-items:center;flex:0 0 auto;min-height:34px;padding:0 10px;border-radius:6px;color:#344054;font-weight:600}body>nav a.active,body>nav a.current{background:#e7f1ef;color:var(--primary)}"
        ".shell{width:min(var(--page-width),calc(100% - var(--page-margin)));margin:0 auto;padding:6px 0 34px}"
        ".page-head{display:flex;align-items:flex-end;justify-content:space-between;gap:16px;margin-bottom:14px}h1,h2,h3,p{margin-top:0}h1{margin-bottom:4px;font-size:26px;line-height:1.25}.subtitle,.note{margin-bottom:0;color:var(--muted)}"
        ".grid{display:grid;grid-template-columns:repeat(12,minmax(0,1fr));gap:12px;align-items:start}.panel{grid-column:span 12;min-width:0;padding:14px;background:var(--surface);border:1px solid var(--line);border-radius:8px}.span-4{grid-column:span 4}.span-6{grid-column:span 6}.span-8{grid-column:span 8}.span-12{grid-column:span 12}.panel h2{margin-bottom:12px;font-size:16px}.panel h3{margin:16px 0 8px;color:#475467;font-size:14px}"
        ".panel-titlebar{display:flex;align-items:center;justify-content:space-between;gap:10px;margin-bottom:12px}.panel-titlebar h2{margin-bottom:0}.panel-tools,.actions{display:flex;flex-wrap:wrap;gap:8px}.panel-tools{justify-content:flex-end}.actions{margin-top:14px}.form-actions{justify-content:flex-end}.title-date{margin-left:8px;color:var(--muted);font-size:13px;font-weight:500}"
        ".overview-status{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:10px}.overview-status div{display:flex;align-items:center;justify-content:space-between;gap:8px;min-width:0;padding:8px 10px;border:1px solid var(--soft);border-radius:6px;background:#f9fafb}.overview-status span,.matrix-head,.matrix-label{color:var(--muted)}.overview-status strong{overflow-wrap:anywhere}"
        ".valve-matrix{display:grid;grid-template-columns:minmax(56px,.7fr) repeat(2,minmax(0,1fr));border:1px solid var(--line);border-radius:8px;overflow:hidden}.valve-matrix>*{min-width:0;padding:8px 10px;border-right:1px solid var(--soft);border-bottom:1px solid var(--soft)}.valve-matrix>:nth-child(3n){border-right:0}.valve-matrix>:nth-last-child(-n+3){border-bottom:0}.matrix-head{background:#f9fafb;font-size:13px;font-weight:650}.matrix-label{font-weight:650}.status-compact{grid-template-columns:1fr;margin-bottom:12px}.valve-action{display:flex;align-items:center;gap:8px;margin-top:12px}"
        ".badge{display:inline-flex;align-items:center;min-height:24px;padding:2px 8px;border-radius:999px;background:#f0f2f4;color:#475467;font-size:13px;font-weight:650;white-space:nowrap}.badge.ok{background:#e7f5ee;color:var(--ok)}.badge.warn{background:#fff5df;color:var(--warn)}.badge.danger{background:#fff0ee;color:var(--danger)}.badge.off{background:#f7f1e8;color:#875a20}"
        "input,select{min-width:0;width:100%;min-height:36px;padding:7px 9px;border:1px solid #cfd6df;border-radius:6px;background:#fff;color:var(--text);font:inherit}input[type=checkbox]{position:absolute;opacity:0;width:1px;min-height:0;margin:0;padding:0;border:0}input:disabled,select:disabled{color:#98a2b3;background:#f3f4f6}.field-grid{display:grid;grid-template-columns:repeat(3,minmax(120px,1fr));gap:12px 14px}.field{display:grid;gap:6px;min-width:0}.field label{color:#475467;font-size:13px;font-weight:650}.check-grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(92px,1fr));gap:8px}.check-item{position:relative;display:flex;align-items:center;justify-content:center;min-height:36px;padding:0 10px;border:1px solid var(--soft);border-radius:6px;background:#fff;color:#344054;font-weight:650}.check-item:has(input:checked){border-color:var(--primary);background:#e7f1ef;color:var(--primary)}"
        ".manual-start{padding:12px}.manual-start form{display:grid;gap:12px}.manual-mode{display:grid;grid-template-columns:minmax(150px,240px) 1fr;gap:10px;align-items:end;padding:10px;border:1px solid var(--soft);border-radius:8px;background:#fbfcfc}.manual-mode .note{padding-bottom:7px}.manual-road-grid{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:10px}.manual-road{display:grid;gap:9px;min-width:0;padding:10px;border:1px solid var(--line);border-radius:8px;background:#fff}.manual-road.off{background:#f8f9fa}.manual-road-head{display:flex;align-items:center;justify-content:space-between;gap:8px}.manual-road-head strong{font-size:15px}.manual-fields{display:grid;grid-template-columns:1fr 1fr;gap:8px}.manual-fields label{display:grid;gap:5px;color:#475467;font-size:13px;font-weight:650}.input-suffix{display:flex;align-items:center;border:1px solid #cfd6df;border-radius:6px;background:#fff;overflow:hidden}.input-suffix input{border:0;border-radius:0}.input-suffix em{padding:0 9px;color:var(--muted);font-style:normal;white-space:nowrap}.manual-road.off .input-suffix{background:#f3f4f6}.manual-road.off .input-suffix input{background:#f3f4f6}"
        "button,.button,input[type=submit]{display:inline-flex;align-items:center;justify-content:center;min-height:32px;padding:0 11px;border:1px solid var(--primary);border-radius:6px;background:var(--primary);color:#fff;font:inherit;font-weight:650;cursor:default}.button.secondary,button.secondary,input.secondary{border-color:#cfd6df;background:#fff;color:#344054}.button.warn,button.warn,input.warn{border-color:#cfd6df;background:#fff;color:#344054}button:disabled,input:disabled{border-color:#d0d5dd;background:#f2f4f7;color:#98a2b3}.input-suffix input,.input-suffix input:disabled{border:0;border-radius:0;margin:0}"
        ".table-wrap{overflow-x:auto;border:1px solid var(--line);border-radius:8px;background:#fff}table{width:100%;border-collapse:collapse;background:#fff}th,td{padding:9px 10px;border-bottom:1px solid var(--soft);text-align:left;white-space:nowrap}th{background:#f9fafb;color:#475467;font-size:13px;font-weight:650}tr:last-child td{border-bottom:0}.action-table th:last-child,.action-table td:last-child{width:1%;text-align:center}.action-table td:last-child button,.action-table td:last-child input{min-width:82px}"
        ".setting-list{border:1px solid var(--line);border-radius:8px;overflow:hidden}.setting-row{display:grid;grid-template-columns:minmax(82px,1fr) minmax(80px,1fr) auto;gap:8px;align-items:center;min-width:0;padding:7px 9px;border-bottom:1px solid var(--soft);background:#fff}.setting-row:last-child{border-bottom:0}.setting-row span{color:var(--muted);font-weight:650}.setting-row strong{min-width:0;overflow-wrap:anywhere}.summary-line{margin-top:12px;padding:8px 10px;border-radius:6px;background:#f9fafb;color:#344054;font-weight:650}.json-box{margin:0;padding:14px;overflow-x:auto;border-radius:8px;background:#182230;color:#d6e4ff;font-size:13px}"
        ".modal[hidden]{display:none}.modal{position:fixed;inset:0;z-index:20;display:grid;place-items:center;padding:18px;background:rgba(15,23,42,.32)}.modal-card{width:min(420px,100%);padding:16px;background:#fff;border:1px solid var(--line);border-radius:8px;box-shadow:0 18px 40px rgba(15,23,42,.18)}.modal-card h2{margin-bottom:4px;font-size:18px}.modal-card .field-grid{grid-template-columns:1fr;margin-top:12px}.modal-card .actions{justify-content:flex-end}.modal-value{margin:6px 0 0;color:var(--muted)}"
        "@media(max-width:980px){.span-4,.span-6,.span-8{grid-column:span 12}.field-grid{grid-template-columns:repeat(2,minmax(0,1fr))}.manual-mode{grid-template-columns:1fr}.manual-road-grid{grid-template-columns:1fr}}"
        "@media(max-width:640px){body{--page-margin:20px;font-size:13px}body>nav{padding:8px 10px}.shell{padding-top:0}.page-head{display:block;margin-bottom:14px}h1{font-size:22px}.panel{padding:12px}.panel-titlebar{align-items:flex-start;flex-direction:column;gap:8px}.panel-tools{justify-content:flex-start}.field-grid{grid-template-columns:1fr}.check-grid{grid-template-columns:repeat(2,minmax(0,1fr))}.overview-status{grid-template-columns:1fr}.valve-matrix{grid-template-columns:minmax(48px,.6fr) repeat(2,minmax(82px,1fr))}.manual-fields{grid-template-columns:1fr}.setting-row{grid-template-columns:1fr auto}.setting-row strong{grid-column:1}.setting-row a,.setting-row button{grid-column:2;grid-row:1/span 2}}"
        "</style><script>document.addEventListener('submit',function(e){var f=e.target;if(!f||String(f.method).toLowerCase()!=='post')return;var raw=f.getAttribute('data-confirm');if(raw==='off')return;var msg=raw||'确认执行此操作？';if(!confirm(msg)){e.preventDefault();}});</script>");
}

void sendHeader(const char* title, const char* pageClass, const char* activePath = nullptr) {
    Esp32BaseWeb::sendHeader(title);
    writeCss();
    Esp32BaseWeb::sendChunk("<script>document.body.className='");
    Esp32BaseWeb::writeHtmlEscaped(pageClass);
    Esp32BaseWeb::sendChunk("';");
    if (activePath && activePath[0]) {
        Esp32BaseWeb::sendChunk("document.querySelectorAll('body>nav a').forEach(function(a){a.classList.remove('active','current');if(a.getAttribute('href')==='");
        Esp32BaseWeb::writeHtmlEscaped(activePath);
        Esp32BaseWeb::sendChunk("'){a.classList.add('active','current');}});");
    }
    Esp32BaseWeb::sendChunk("</script><main class='shell'>");
}

void sendFooter() {
    Esp32BaseWeb::sendChunk("</main>");
    Esp32BaseWeb::sendFooter();
}

void redirectTo(const char* path) {
    Esp32BaseWeb::redirectSeeOther(path);
}

void writePageHead(const char* title, const char* subtitle) {
    Esp32BaseWeb::sendChunk("<header class='page-head'><div><h1>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("</h1><p class='subtitle'>");
    Esp32BaseWeb::writeHtmlEscaped(subtitle);
    Esp32BaseWeb::sendChunk("</p></div></header>");
}

void writeWateringStatusPanel(const char* title) {
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("</h2><div class='overview-status status-compact'><div><span>当前浇水</span><strong>");
    Esp32BaseWeb::writeHtmlEscaped(WateringSession::isActive() ? modeLabel(WateringSession::mode()) : "未运行");
    Esp32BaseWeb::sendChunk("</strong></div></div><div class='valve-matrix' role='table'><div class='matrix-head'>项目</div><div class='matrix-head'>第 1 路</div><div class='matrix-head'>第 2 路</div>");
    const char* labels[] = {"状态", "目标", "剩余", "水量", "流速"};
    for (uint8_t row = 0; row < 5; ++row) {
        Esp32BaseWeb::sendChunk("<div class='matrix-label'>");
        Esp32BaseWeb::sendChunk(labels[row]);
        Esp32BaseWeb::sendChunk("</div>");
        for (uint8_t road = 1; road <= 2; ++road) {
            const WateringSession::RoadStatus& status = WateringSession::roadStatus(road);
            const bool enabled = SettingsStore::isRoadEnabled(road);
            uint32_t remainingSec = 0;
            if (status.state == WateringSession::ROAD_RUNNING && status.targetSec > 0) {
                const uint32_t elapsed = (Esp32BaseSystem::uptimeMs() - status.startedMs) / 1000UL;
                remainingSec = elapsed < status.targetSec ? status.targetSec - elapsed : 0;
            }
            const uint32_t pulses = status.lastPulseCount >= status.startedPulseCount ? status.lastPulseCount - status.startedPulseCount : 0;
            Esp32BaseWeb::sendChunk("<div><strong>");
            if (!enabled && row > 0) {
                Esp32BaseWeb::sendChunk("-");
            } else if (row == 0) {
                Esp32BaseWeb::writeHtmlEscaped(enabled ? roadStateLabel(status.state) : "未启用");
            } else if (row == 1) {
                writeMinutesFromSeconds(status.targetSec);
                Esp32BaseWeb::sendChunk(" 分钟");
            } else if (row == 2) {
                writeMinutesFromSeconds(remainingSec);
                Esp32BaseWeb::sendChunk(" 分钟");
            } else if (row == 3) {
                writeLitersFromMl(SettingsStore::estimateMilliliters(road, pulses));
            } else {
                writeFixed2FromX100(flowRateLiterPerMinuteX100(road));
                Esp32BaseWeb::sendChunk(" L/min");
            }
            Esp32BaseWeb::sendChunk("</strong></div>");
        }
    }
    Esp32BaseWeb::sendChunk("</div><div class='valve-action'>");
    const bool active = WateringSession::isActive();
    const char* disabled = active ? "" : " disabled";
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/water/stop' data-confirm='确认停止全部浇水？'><input type='hidden' name='road' value='0'><button class='secondary'");
    Esp32BaseWeb::sendChunk(disabled);
    Esp32BaseWeb::sendChunk(">停止全部</button></form>");
    for (uint8_t road = 1; road <= 2; ++road) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/water/stop' data-confirm='确认停止第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路？'><input type='hidden' name='road' value='");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("'><button class='secondary'");
        Esp32BaseWeb::sendChunk(active && SettingsStore::isRoadEnabled(road) ? "" : " disabled");
        Esp32BaseWeb::sendChunk(">停止第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路</button></form>");
    }
    Esp32BaseWeb::sendChunk(active ? "" : "<span class='note'>当前未运行，停止不可用。</span>");
    Esp32BaseWeb::sendChunk("</div></div>");
}

const char* signalQuality(long rssi) {
    if (rssi >= -60) return "优秀";
    if (rssi >= -70) return "良好";
    if (rssi >= -80) return "一般";
    return "较弱";
}

void handleOverviewPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    sendHeader("总览", "page-overview");
    writePageHead("总览", "只看系统状态、阀门状态和需要立即注意的信息。");
    Esp32BaseWeb::sendChunk("<section class='grid'><div class='panel span-12'><h2>设备状态</h2><div class='overview-status'><div><span>设备</span><strong><span class='badge ok'>正常</span></strong></div><div><span>当前</span><strong>");
    Esp32BaseWeb::sendChunk(WateringSession::isActive() ? "浇水中" : "空闲");
    Esp32BaseWeb::sendChunk("</strong></div><div><span>WiFi</span><strong>");
#if ESP32BASE_ENABLE_WIFI
    Esp32BaseWeb::writeHtmlEscaped(Esp32BaseWiFi::ssid());
    Esp32BaseWeb::sendChunk("</strong></div><div><span>信号</span><strong>");
    Esp32BaseWeb::writeHtmlEscaped(signalQuality(Esp32BaseWiFi::rssi()));
    Esp32BaseWeb::sendChunk(" (");
    char rssi[16];
    snprintf(rssi, sizeof(rssi), "%ld dBm", static_cast<long>(Esp32BaseWiFi::rssi()));
    Esp32BaseWeb::writeHtmlEscaped(rssi);
#else
    Esp32BaseWeb::sendChunk("-");
    Esp32BaseWeb::sendChunk("</strong></div><div><span>信号</span><strong>-");
#endif
    Esp32BaseWeb::sendChunk(")</strong></div></div></div>");
    writeWateringStatusPanel("浇水状态");
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>异常</h2>");
    if (LeakMonitor::hasAlert()) {
        Esp32BaseWeb::sendChunk("<span class='badge danger'>存在异常</span><p class='note'>请确认现场状态，处理后清除提示。</p><form method='post' action='/api/v1/alerts/clear' data-confirm='确认现场已处理并解除异常提示？'><button>解除异常</button></form>");
    } else {
        Esp32BaseWeb::sendChunk("<span class='badge ok'>无当前异常</span><p class='note'>存在异常时在这里显示原因和状态，历史事件在记录页查看。</p>");
    }
    Esp32BaseWeb::sendChunk("</div></section>");
    sendFooter();
}

void handleManualPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    const SettingsStore::Settings& settings = SettingsStore::current();
    sendHeader("手动浇水", "page-form");
    writePageHead("手动浇水", "每路独立选择是否参与，本页统一开始；停止操作必须确认。");
    Esp32BaseWeb::sendChunk("<section class='grid'>");
    writeWateringStatusPanel("浇水状态");
    Esp32BaseWeb::sendChunk("<div class='panel span-12 manual-start'><h2>启动浇水</h2><p class='inline-notice note'>上次操作：");
    Esp32BaseWeb::writeHtmlEscaped(WateringSession::stopReasonName(WateringSession::lastStopReason()));
    Esp32BaseWeb::sendChunk("</p><form method='post' action='/api/v1/water/start' data-confirm='确认开始手动浇水？'><div class='manual-mode'><div class='field'><label>执行模式</label><select name='mode'>");
    writeModeOptions(settings.defaultMode);
    Esp32BaseWeb::sendChunk("</select></div><p class='note'>同时模式会一起开阀，顺序模式按路号依次执行。</p></div><div class='manual-road-grid'>");
    for (uint8_t road = 1; road <= 2; ++road) {
        const bool enabled = SettingsStore::isRoadEnabled(road);
        Esp32BaseWeb::sendChunk("<div class='manual-road");
        Esp32BaseWeb::sendChunk(enabled ? "" : " off");
        Esp32BaseWeb::sendChunk("'><div class='manual-road-head'><strong>第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路</strong><span class='badge");
        Esp32BaseWeb::sendChunk(enabled ? " ok" : " off");
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(enabled ? "已启用" : "未启用");
        Esp32BaseWeb::sendChunk("</span></div><div class='manual-fields'><label><span>参与</span><select name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_enabled'");
        Esp32BaseWeb::sendChunk(enabled ? "" : " disabled");
        Esp32BaseWeb::sendChunk("><option value='1'>浇水</option><option value='0'");
        writeSelected(!enabled);
        Esp32BaseWeb::sendChunk(">");
        Esp32BaseWeb::sendChunk(enabled ? "不浇水" : "未启用");
        Esp32BaseWeb::sendChunk("</option></select></label><label><span>时长</span><span class='input-suffix'><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_min' type='number' min='1' max='240' value='");
        writeMinutesFromSeconds(settings.quickDurationSec[road - 1]);
        Esp32BaseWeb::sendChunk("'");
        Esp32BaseWeb::sendChunk(SettingsStore::isRoadEnabled(road) ? "" : " disabled");
        Esp32BaseWeb::sendChunk("><em>分钟</em></span></label></div></div>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='actions'><button>开始浇水</button></div></form></div></section>");
    sendFooter();
}

