tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
uint32_t readCycleMaskFromForm(uint8_t cycleDays) {
    uint32_t mask = 0;
    if (Esp32BaseWeb::hasParam("cycle_mask")) {
        uint32_t value = 0;
        if (readU32Param("cycle_mask", &value)) {
            mask = value;
        }
    }
    for (uint8_t i = 0; i < cycleDays; ++i) {
        char name[8];
        snprintf(name, sizeof(name), "d%u", static_cast<unsigned>(i));
        if (Esp32BaseWeb::hasParam(name)) {
            mask |= (1UL << i);
        }
    }
    return mask == 0 ? 0x01 : mask;
}

void handlePlanEditPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint16_t raw = 0;
    const uint8_t index = (Esp32BaseWeb::hasParam("edit") && readUIntParam("edit", &raw) && raw < PlanStore::MaxPlans) ? static_cast<uint8_t>(raw) : 0;
    const PlanStore::Plan& plan = PlanStore::get(index);
    sendHeader("编辑计划", "page-form", "/irrigation/plan-config");
    writePageHead("编辑计划", "编辑单个计划的固定配置，保存后用于后续自动浇水。");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/plans' data-confirm='确认保存计划？'><input type='hidden' name='index' value='");
    writeUInt(index);
    Esp32BaseWeb::sendChunk("'><section class='grid'><div class='panel span-12'><div class='panel-titlebar'><h2>计划 ");
    writeUInt(index + 1);
    Esp32BaseWeb::sendChunk("</h2><a class='button secondary' href='/irrigation/plan-config'>返回计划配置</a></div></div><div class='panel span-12'><h2>计划状态</h2><div class='field-grid'><div class='field'><label>启用状态</label><select name='enabled'><option value='0'");
    writeSelected(!plan.enabled);
    Esp32BaseWeb::sendChunk(">停用</option><option value='1'");
    writeSelected(plan.enabled);
    Esp32BaseWeb::sendChunk(">启用</option></select></div><div class='field'><label>执行时间</label><input name='time' type='time' value='");
    writeMinuteOfDay(plan.minuteOfDay);
    Esp32BaseWeb::sendChunk("'></div><div class='field'><label>执行模式</label><select name='mode'>");
    writeModeOptions(plan.mode);
    Esp32BaseWeb::sendChunk("</select></div></div></div><div class='panel span-12'><h2>浇水路配置</h2><div class='valve-matrix config-matrix'><div class='matrix-head'>项目</div><div class='matrix-head'>第 1 路</div><div class='matrix-head'>第 2 路</div><div class='matrix-label'>参与</div>");
    for (uint8_t road = 1; road <= 2; ++road) {
        Esp32BaseWeb::sendChunk("<div><select name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_enabled'");
        Esp32BaseWeb::sendChunk(SettingsStore::isRoadEnabled(road) ? "" : " disabled");
        Esp32BaseWeb::sendChunk("><option value='1'");
        writeSelected(plan.roadSec[road - 1] > 0);
        Esp32BaseWeb::sendChunk(">浇水</option><option value='0'");
        writeSelected(plan.roadSec[road - 1] == 0);
        Esp32BaseWeb::sendChunk(">");
        Esp32BaseWeb::sendChunk(SettingsStore::isRoadEnabled(road) ? "不浇水" : "未启用");
        Esp32BaseWeb::sendChunk("</option></select></div>");
    }
    Esp32BaseWeb::sendChunk("<div class='matrix-label'>时长</div>");
    for (uint8_t road = 1; road <= 2; ++road) {
        Esp32BaseWeb::sendChunk("<div><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_min' type='number' min='0' max='240' value='");
        writeMinutesFromSeconds(plan.roadSec[road - 1]);
        Esp32BaseWeb::sendChunk("'");
        Esp32BaseWeb::sendChunk(SettingsStore::isRoadEnabled(road) ? "" : " disabled");
        Esp32BaseWeb::sendChunk("></div>");
    }
    Esp32BaseWeb::sendChunk("</div></div><div class='panel span-12'><h2>循环规则</h2><div class='field-grid'><div class='field'><label>循环天数</label><input id='cycleDays' name='cycle_days' type='number' min='1' max='30' value='");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk("'></div><div class='field'><label>循环开始日期</label><input name='cycle_start_ymd' type='number' min='20000101' max='20991231' value='");
    writeUInt(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("'></div></div><h3>循环执行日</h3><div class='check-grid' id='cycleDayList'>");
    for (uint8_t i = 0; i < 30; ++i) {
        Esp32BaseWeb::sendChunk("<label class='check-item' data-day='");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("'><input type='checkbox' name='d");
        writeUInt(i);
        Esp32BaseWeb::sendChunk("'");
        writeChecked((plan.cycleMask & (1UL << i)) != 0);
        Esp32BaseWeb::sendChunk("> 第 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk(" 天</label>");
    }
    Esp32BaseWeb::sendChunk("</div><p class='note'>计划只使用循环规则：每天浇水是 1 天循环；浇 2 天停 1 天是 3 天循环并执行第 1、2 天；每周固定日期是 7 天循环。</p></div><div class='panel span-12'><div class='actions form-actions'><a class='button secondary' href='/irrigation/plan-config'>返回计划配置</a><button>保存计划</button></div></div></section></form><script>(function(){var n=document.getElementById('cycleDays');var list=document.getElementById('cycleDayList');function sync(){var max=Math.max(1,Math.min(30,parseInt(n.value||'1',10)||1));n.value=max;list.querySelectorAll('[data-day]').forEach(function(item){var show=parseInt(item.dataset.day,10)<=max;item.style.display=show?'flex':'none';if(!show){var c=item.querySelector('input');if(c)c.checked=false;}});}if(n&&list){n.addEventListener('input',sync);sync();}})();</script>");
    sendFooter();
}

void writeSettingRow(const char* key, const char* label, const char* value) {
    Esp32BaseWeb::sendChunk("<div class='setting-row'><span>");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("</span><strong>");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("</strong><button type='button' class='secondary' data-setting-open='setting-");
    Esp32BaseWeb::writeHtmlEscaped(key);
    Esp32BaseWeb::sendChunk("'>修改</button></div>");
}

void writeSettingReadOnlyRow(const char* label, const char* value, const char* note) {
    Esp32BaseWeb::sendChunk("<div class='setting-row'><span>");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("</span><strong>");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("</strong><small class='note'>");
    Esp32BaseWeb::writeHtmlEscaped(note);
    Esp32BaseWeb::sendChunk("</small></div>");
}

void writeSettingsModalScript() {
    Esp32BaseWeb::sendChunk(
        "<script>(function(){"
        "function closeAll(){document.querySelectorAll('.modal').forEach(function(m){m.hidden=true;});}"
        "document.addEventListener('click',function(e){"
        "var open=e.target.closest('[data-setting-open]');"
        "if(open){var m=document.getElementById(open.getAttribute('data-setting-open'));if(m){m.hidden=false;var f=m.querySelector('input,select,button');if(f)f.focus();}return;}"
        "if(e.target.matches('[data-setting-close]')||e.target.classList.contains('modal'))closeAll();"
        "});"
        "document.addEventListener('keydown',function(e){if(e.key==='Escape')closeAll();});"
        "})();</script>");
}

void writeSettingEditModal(const char* edit, const char* title, const char* currentValue) {
    if (!edit || edit[0] == '\0') {
        return;
    }
    const SettingsStore::Settings& s = SettingsStore::current();
    Esp32BaseWeb::sendChunk("<div class='modal' id='setting-");
    Esp32BaseWeb::writeHtmlEscaped(edit);
    Esp32BaseWeb::sendChunk("' hidden><div class='modal-card' role='dialog' aria-modal='true'><h2>修改参数</h2><p class='modal-value'>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("：");
    Esp32BaseWeb::writeHtmlEscaped(currentValue);
    Esp32BaseWeb::sendChunk("</p><form method='post' action='/irrigation/settings/config' data-confirm='确认保存设置？'><div class='field-grid'>");
    if (strcmp(edit, "default_mode") == 0) {
        Esp32BaseWeb::sendChunk("<div class='field'><label>默认模式</label><select name='default_mode'>");
        writeModeOptions(s.defaultMode);
        Esp32BaseWeb::sendChunk("</select></div>");
    } else if (strcmp(edit, "r1_enabled") == 0 || strcmp(edit, "r2_enabled") == 0) {
        const uint8_t road = strcmp(edit, "r1_enabled") == 0 ? 1 : 2;
        Esp32BaseWeb::sendChunk("<input type='hidden' name='road' value='");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("'><div class='field'><label>启用状态</label><select name='enabled'><option value='1'");
        writeSelected(SettingsStore::isRoadEnabled(road));
        Esp32BaseWeb::sendChunk(">已启用</option><option value='0'");
        writeSelected(!SettingsStore::isRoadEnabled(road));
        Esp32BaseWeb::sendChunk(">未启用</option></select></div>");
    } else if (strcmp(edit, "r1_name") == 0 || strcmp(edit, "r2_name") == 0) {
        const uint8_t road = strcmp(edit, "r1_name") == 0 ? 1 : 2;
        Esp32BaseWeb::sendChunk("<div class='field'><label>名称</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_name' maxlength='11' value='");
        Esp32BaseWeb::writeHtmlEscaped(s.roads[road - 1].name);
        Esp32BaseWeb::sendChunk("'></div>");
    } else if (strcmp(edit, "quick_r1_min") == 0 || strcmp(edit, "quick_r2_min") == 0) {
        const uint8_t road = strcmp(edit, "quick_r1_min") == 0 ? 1 : 2;
        Esp32BaseWeb::sendChunk("<div class='field'><label>默认时长（分钟）</label><input name='quick_r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_min' type='number' min='1' max='240' value='");
        writeMinutesFromSeconds(s.quickDurationSec[road - 1]);
        Esp32BaseWeb::sendChunk("'></div>");
    } else if (strcmp(edit, "r1_pulse_per_liter") == 0 || strcmp(edit, "r2_pulse_per_liter") == 0) {
        const uint8_t road = strcmp(edit, "r1_pulse_per_liter") == 0 ? 1 : 2;
        Esp32BaseWeb::sendChunk("<div class='field'><label>每升脉冲</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_pulse_per_liter' type='number' min='1' max='10000' value='");
        writeUInt(s.roads[road - 1].pulsePerLiter);
        Esp32BaseWeb::sendChunk("'></div>");
    } else if (strcmp(edit, "r1_calibration_x1000") == 0 || strcmp(edit, "r2_calibration_x1000") == 0) {
        const uint8_t road = strcmp(edit, "r1_calibration_x1000") == 0 ? 1 : 2;
        Esp32BaseWeb::sendChunk("<div class='field'><label>校准系数</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_calibration_x1000' type='number' min='100' max='10000' value='");
        writeUInt(s.roads[road - 1].calibrationX1000);
        Esp32BaseWeb::sendChunk("'></div>");
    } else if (strcmp(edit, "flow_no_pulse_timeout_s") == 0 || strcmp(edit, "idle_leak_window_s") == 0 || strcmp(edit, "idle_leak_pulse_threshold") == 0) {
        uint16_t current = s.flowNoPulseTimeoutSec;
        const char* label = "无脉冲超时";
        uint16_t max = 60;
        if (strcmp(edit, "idle_leak_window_s") == 0) {
            current = s.idleLeakWindowSec;
            label = "漏水窗口";
        } else if (strcmp(edit, "idle_leak_pulse_threshold") == 0) {
            current = s.idleLeakPulseThreshold;
            label = "漏水脉冲阈值";
            max = 100;
        }
        Esp32BaseWeb::sendChunk("<div class='field'><label>");
        Esp32BaseWeb::writeHtmlEscaped(label);
        Esp32BaseWeb::sendChunk("</label><input name='");
        Esp32BaseWeb::writeHtmlEscaped(edit);
        Esp32BaseWeb::sendChunk("' type='number' min='1' max='");
        writeUInt(max);
        Esp32BaseWeb::sendChunk("' value='");
        writeUInt(current);
        Esp32BaseWeb::sendChunk("'></div>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='actions'><button type='button' class='secondary' data-setting-close>取消</button><button>保存</button></div></form></div></div>");
}

void writeSettingEditModals() {
    const SettingsStore::Settings& s = SettingsStore::current();
    char value[32];
    writeSettingEditModal("default_mode", "默认模式", modeLabel(s.defaultMode));
    for (uint8_t road = 1; road <= 2; ++road) {
        const SettingsStore::RoadConfig& r = s.roads[road - 1];
        snprintf(value, sizeof(value), "%s", SettingsStore::isRoadEnabled(road) ? "已启用" : "未启用");
        writeSettingEditModal(road == 1 ? "r1_enabled" : "r2_enabled", road == 1 ? "第 1 路启用状态" : "第 2 路启用状态", value);
        writeSettingEditModal(road == 1 ? "r1_name" : "r2_name", road == 1 ? "第 1 路名称" : "第 2 路名称", r.name);
        snprintf(value, sizeof(value), "%u 分钟", static_cast<unsigned>(s.quickDurationSec[road - 1] / 60U));
        writeSettingEditModal(road == 1 ? "quick_r1_min" : "quick_r2_min", road == 1 ? "第 1 路默认时长" : "第 2 路默认时长", value);
        snprintf(value, sizeof(value), "%u pulse/L", static_cast<unsigned>(r.pulsePerLiter));
        writeSettingEditModal(road == 1 ? "r1_pulse_per_liter" : "r2_pulse_per_liter", road == 1 ? "第 1 路每升脉冲" : "第 2 路每升脉冲", value);
        snprintf(value, sizeof(value), "%u", static_cast<unsigned>(r.calibrationX1000));
        writeSettingEditModal(road == 1 ? "r1_calibration_x1000" : "r2_calibration_x1000", road == 1 ? "第 1 路校准系数" : "第 2 路校准系数", value);
    }
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.flowNoPulseTimeoutSec));
    writeSettingEditModal("flow_no_pulse_timeout_s", "无脉冲超时", value);
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.idleLeakWindowSec));
    writeSettingEditModal("idle_leak_window_s", "漏水窗口", value);
    snprintf(value, sizeof(value), "%u", static_cast<unsigned>(s.idleLeakPulseThreshold));
    writeSettingEditModal("idle_leak_pulse_threshold", "漏水脉冲阈值", value);
}

void handleSettingsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    const SettingsStore::Settings& s = SettingsStore::current();
    sendHeader("设置", "page-settings");
    writePageHead("设置", "查看当前灌溉参数，每次只修改一个参数。");
    char value[32];
    Esp32BaseWeb::sendChunk("<section class='grid'>");
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>灌溉设置</h2><div class='setting-list'>");
    snprintf(value, sizeof(value), "%u 路", static_cast<unsigned>(SettingsStore::enabledRoads()));
    writeSettingReadOnlyRow("已启用路数", value, "由各路启用状态计算");
    writeSettingRow("default_mode", "默认模式", modeLabel(s.defaultMode));
    Esp32BaseWeb::sendChunk("</div></div>");
    for (uint8_t road = 1; road <= 2; ++road) {
        const SettingsStore::RoadConfig& r = s.roads[road - 1];
        Esp32BaseWeb::sendChunk("<div class='panel span-6'><h2>第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路配置</h2><div class='setting-list'>");
        writeSettingRow(road == 1 ? "r1_enabled" : "r2_enabled", "启用状态", SettingsStore::isRoadEnabled(road) ? "已启用" : "未启用");
        writeSettingRow(road == 1 ? "r1_name" : "r2_name", "名称", r.name);
        snprintf(value, sizeof(value), "%u 分钟", static_cast<unsigned>(s.quickDurationSec[road - 1] / 60U));
        writeSettingRow(road == 1 ? "quick_r1_min" : "quick_r2_min", "默认时长", value);
        snprintf(value, sizeof(value), "%u pulse/L", static_cast<unsigned>(r.pulsePerLiter));
        writeSettingRow(road == 1 ? "r1_pulse_per_liter" : "r2_pulse_per_liter", "每升脉冲", value);
        snprintf(value, sizeof(value), "%u", static_cast<unsigned>(r.calibrationX1000));
        writeSettingRow(road == 1 ? "r1_calibration_x1000" : "r2_calibration_x1000", "校准系数", value);
        Esp32BaseWeb::sendChunk("</div></div>");
    }
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>水流检测</h2><div class='setting-list'>");
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.flowNoPulseTimeoutSec));
    writeSettingRow("flow_no_pulse_timeout_s", "无脉冲超时", value);
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.idleLeakWindowSec));
    writeSettingRow("idle_leak_window_s", "漏水窗口", value);
    snprintf(value, sizeof(value), "%u", static_cast<unsigned>(s.idleLeakPulseThreshold));
    writeSettingRow("idle_leak_pulse_threshold", "漏水脉冲阈值", value);
    Esp32BaseWeb::sendChunk("</div></div>");
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>维护</h2><div class='setting-list'>");
    writeSettingReadOnlyRow("恢复出厂请求", SafetyManager::factoryResetRequested() ? "已由 BOOT 键请求" : "未请求", "BOOT 长按会直接恢复配置并重启");
    writeSettingReadOnlyRow("恢复出厂状态", MaintenanceService::factoryResetPending() ? "等待重启执行" : "空闲", "执行时会先关闭所有阀门");
    Esp32BaseWeb::sendChunk("</div><form method='post' action='/api/v1/maintenance/factory-reset' data-confirm='确认恢复出厂？设备会关闭阀门并重启。'><div class='field-grid' style='margin-top:12px'><div class='field'><label>确认文本</label><input name='confirm' maxlength='5' placeholder='RESET'></div><div class='field'><label>记录处理</label><select name='clear_records'><option value='0'>保留记录和事件</option><option value='1'>同时清空记录和事件</option></select></div></div><div class='actions'><button class='warn'>恢复出厂</button></div></form></div>");
    Esp32BaseWeb::sendChunk("</section>");
    writeSettingEditModals();
    writeSettingsModalScript();
    sendFooter();
}

void handleDataPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    sendHeader("数据记录", "page-table");
    writePageHead("数据记录", "查看什么时候浇水、实际执行多久、为什么结束。");
    Esp32BaseWeb::sendChunk("<section class='grid'><div class='panel span-12'><div class='panel-titlebar'><h2>浇水记录</h2><div class='panel-tools'><a class='button secondary' href='/api/v1/records'>JSON</a><a class='button secondary' href='/api/v1/records.csv'>CSV 导出</a></div></div><div class='table-wrap'><table><thead><tr><th>ID</th><th>来源</th><th>模式</th><th>结束原因</th><th>路</th><th>目标</th><th>实际</th><th>水量</th></tr></thead><tbody>");
    auto recordCb = [](const RecordStore::Record& record, void*) {
        for (uint8_t road = 1; road <= 2; ++road) {
            const RecordStore::RoadRecord& rr = record.roads[road - 1];
            const uint32_t actualSec = rr.endedMs >= rr.startedMs && rr.startedMs > 0 ? (rr.endedMs - rr.startedMs) / 1000UL : 0;
            Esp32BaseWeb::sendChunk("<tr><td>");
            writeUInt(record.id);
            Esp32BaseWeb::sendChunk("</td><td>");
            Esp32BaseWeb::writeHtmlEscaped(RecordStore::sourceName(static_cast<RecordStore::Source>(record.source)));
            Esp32BaseWeb::sendChunk("</td><td>");
            Esp32BaseWeb::writeHtmlEscaped(modeLabel(static_cast<SettingsStore::ExecutionMode>(record.mode)));
            Esp32BaseWeb::sendChunk("</td><td>");
            Esp32BaseWeb::writeHtmlEscaped(WateringSession::stopReasonName(static_cast<WateringSession::StopReason>(record.stopReason)));
            Esp32BaseWeb::sendChunk("</td><td>第 ");
            writeUInt(road);
            Esp32BaseWeb::sendChunk(" 路</td><td>");
            writeMinutesFromSeconds(rr.targetSec);
            Esp32BaseWeb::sendChunk(" 分钟</td><td>");
            writeUInt(actualSec);
            Esp32BaseWeb::sendChunk(" 秒</td><td>");
            writeLitersFromMl(rr.estimatedMilliliters);
            Esp32BaseWeb::sendChunk("</td></tr>");
        }
    };
    (void)RecordStore::readLatest(0, 10, recordCb, nullptr);
    Esp32BaseWeb::sendChunk("</tbody></table></div></div><div class='panel span-12'><div class='panel-titlebar'><h2>系统事件</h2><div class='panel-tools'><a class='button secondary' href='/api/v1/events'>JSON</a><a class='button secondary' href='/api/v1/events.csv'>CSV 导出</a></div></div><p class='note'>系统事件来自 EventStore，用于排查启动、配置变更、计划变更、浇水开始/停止/错误、漏水告警和告警解除。</p><div class='table-wrap'><table><thead><tr><th>ID</th><th>类型</th><th>来源</th><th>影响对象</th><th>说明</th></tr></thead><tbody>");
    auto eventCb = [](const EventStore::Event& event, void*) {
        Esp32BaseWeb::sendChunk("<tr><td>");
        writeUInt(event.id);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(EventStore::typeName(static_cast<EventStore::Type>(event.type)));
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(EventStore::sourceName(static_cast<EventStore::Source>(event.source)));
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(event.road);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(event.text);
        Esp32BaseWeb::sendChunk("</td></tr>");
    };
    (void)EventStore::readLatest(0, 20, eventCb, nullptr);
    Esp32BaseWeb::sendChunk("</tbody></table></div></div></section>");
    sendFooter();
}

void handleDebugPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    sendHeader("调试", "page-table");
    writePageHead("调试与状态 API", "查看业务状态 JSON，用于联调和问题排查。");
    Esp32BaseWeb::sendChunk("<section class='grid'><div class='panel span-12'><h2>状态 JSON</h2><p class='note'>实时内容由接口返回。</p><div class='actions'><a class='button secondary' href='/api/v1/status'>打开 /api/v1/status</a></div></div></section>");
    sendFooter();
}

void writeSettingsJson() {
    const SettingsStore::Settings& s = SettingsStore::current();
    Esp32BaseWeb::sendChunk("\"settings\":{\"enabled_roads\":");
    writeUInt(SettingsStore::enabledRoads());
    Esp32BaseWeb::sendChunk(",\"road_enabled_mask\":");
    writeUInt(SettingsStore::roadEnabledMask());
    Esp32BaseWeb::sendChunk(",\"default_mode\":\"");
    Esp32BaseWeb::writeJsonEscaped(modeName(s.defaultMode));
    Esp32BaseWeb::sendChunk("\",\"flow_no_pulse_timeout_s\":");
    writeUInt(s.flowNoPulseTimeoutSec);
    Esp32BaseWeb::sendChunk(",\"idle_leak_window_s\":");
    writeUInt(s.idleLeakWindowSec);
    Esp32BaseWeb::sendChunk(",\"idle_leak_pulse_threshold\":");
    writeUInt(s.idleLeakPulseThreshold);
    Esp32BaseWeb::sendChunk(",\"roads\":{\"r1\":{\"enabled\":");
    writeBool(SettingsStore::isRoadEnabled(1));
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(s.roads[0].name);
    Esp32BaseWeb::sendChunk("\",\"quick_duration_sec\":");
    writeUInt(s.quickDurationSec[0]);
    Esp32BaseWeb::sendChunk(",\"pulse_per_liter\":");
    writeUInt(s.roads[0].pulsePerLiter);
    Esp32BaseWeb::sendChunk(",\"calibration_x1000\":");
    writeUInt(s.roads[0].calibrationX1000);
    Esp32BaseWeb::sendChunk("},\"r2\":{\"enabled\":");
    writeBool(SettingsStore::isRoadEnabled(2));
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(s.roads[1].name);
    Esp32BaseWeb::sendChunk("\",\"quick_duration_sec\":");
    writeUInt(s.quickDurationSec[1]);
    Esp32BaseWeb::sendChunk(",\"pulse_per_liter\":");
    writeUInt(s.roads[1].pulsePerLiter);
    Esp32BaseWeb::sendChunk(",\"calibration_x1000\":");
    writeUInt(s.roads[1].calibrationX1000);
    Esp32BaseWeb::sendChunk("}}}");
}

