tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleConfigApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        beginJson();
        Esp32BaseWeb::sendChunk("{");
        writeSettingsJson();
        Esp32BaseWeb::sendChunk("}");
        endJson();
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("GET,POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    const char* error = nullptr;
    if (!saveConfigFromRequest(&error)) {
        sendConfigError(error);
        return;
    }
    Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
}

void handleSettingsConfigForm() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    const char* error = nullptr;
    if (!saveConfigFromRequest(&error)) {
        sendConfigError(error);
        return;
    }
    redirectTo("/irrigation/settings");
}

void handleWaterStartApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    uint16_t r1Min = 0;
    uint16_t r2Min = 0;
    bool useR1 = true;
    bool useR2 = false;
    SettingsStore::ExecutionMode mode = SettingsStore::defaultExecutionMode();
    (void)readBoolParam("r1_enabled", &useR1);
    (void)readBoolParam("r2_enabled", &useR2);
    if ((useR1 && (!readUIntParam("r1_min", &r1Min) || r1Min < 1 || r1Min > 240)) ||
        (useR2 && (!readUIntParam("r2_min", &r2Min) || r2Min < 1 || r2Min > 240))) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_duration\"}");
        return;
    }
    if (Esp32BaseWeb::hasParam("mode") && !readModeParam("mode", &mode)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_mode\"}");
        return;
    }
    const uint16_t r1Sec = useR1 ? minutesToSeconds(r1Min) : 0;
    const uint16_t r2Sec = useR2 ? minutesToSeconds(r2Min) : 0;
    if (!WateringSession::startManual(r1Sec, r2Sec, mode, RecordStore::SOURCE_WEB, "web manual")) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_watering_request\"}");
        return;
    }
    redirectTo("/irrigation/manual");
}

void handleWaterStopApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    uint16_t road = 0;
    (void)readUIntParam("road", &road);
    if (road == 0) {
        WateringSession::stopAll(WateringSession::REASON_MANUAL_STOP, "web stop all");
    } else if (road <= 2) {
        WateringSession::stopRoad(static_cast<uint8_t>(road), WateringSession::REASON_MANUAL_STOP, "web stop road");
    } else {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_road\"}");
        return;
    }
    redirectTo("/irrigation/manual");
}

void handleAlertsClearApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    LeakMonitor::clearAlerts(EventStore::SOURCE_WEB);
    redirectTo("/irrigation");
}

void handleFactoryResetApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (MaintenanceService::factoryResetPending()) {
        Esp32BaseWeb::sendJson(409, "{\"ok\":false,\"error\":\"factory_reset_pending\"}");
        return;
    }
    char confirm[8] = "";
    bool clearRecords = false;
    (void)readBoolParam("clear_records", &clearRecords);
    if (!Esp32BaseWeb::getParam("confirm", confirm, sizeof(confirm)) || strcmp(confirm, "RESET") != 0) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"confirmation_required\"}");
        return;
    }
    if (!MaintenanceService::requestFactoryReset(clearRecords)) {
        Esp32BaseWeb::sendJson(409, "{\"ok\":false,\"error\":\"factory_reset_pending\"}");
        return;
    }
    redirectTo("/irrigation/settings");
}

void handlePlansApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        beginJson();
        Esp32BaseWeb::sendChunk("{\"count\":");
        writeUInt(PlanStore::MaxPlans);
        Esp32BaseWeb::sendChunk(",\"plans\":[");
        for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
            if (i) Esp32BaseWeb::sendChunk(",");
            writePlanJson(i, PlanStore::get(i));
        }
        Esp32BaseWeb::sendChunk("]}");
        endJson();
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("GET,POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    uint16_t indexRaw = 0;
    if (!readUIntParam("index", &indexRaw) || indexRaw >= PlanStore::MaxPlans) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_index\"}");
        return;
    }
    PlanStore::Plan plan = PlanStore::get(static_cast<uint8_t>(indexRaw));
    bool enabled = false;
    uint16_t value = 0;
    if (readBoolParam("enabled", &enabled)) plan.enabled = enabled;
    if (Esp32BaseWeb::hasParam("time") && !readMinuteOfDayParam("time", &plan.minuteOfDay)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_time\"}");
        return;
    }
    if (Esp32BaseWeb::hasParam("r1_min")) {
        uint16_t seconds = 0;
        if (!readPlanDurationSecondsParam("r1_min", &seconds)) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_duration\"}");
            return;
        }
        plan.roadSec[0] = seconds;
    }
    if (Esp32BaseWeb::hasParam("r2_min")) {
        uint16_t seconds = 0;
        if (!readPlanDurationSecondsParam("r2_min", &seconds)) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_duration\"}");
            return;
        }
        plan.roadSec[1] = seconds;
    }
    bool useRoad = false;
    if (readBoolParam("r1_enabled", &useRoad) && !useRoad) plan.roadSec[0] = 0;
    if (readBoolParam("r2_enabled", &useRoad) && !useRoad) plan.roadSec[1] = 0;
    SettingsStore::ExecutionMode mode = plan.mode;
    if (Esp32BaseWeb::hasParam("mode")) {
        if (!readModeParam("mode", &mode)) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_mode\"}");
            return;
        }
        plan.mode = mode;
    }
    if (Esp32BaseWeb::hasParam("cycle_days")) {
        if (!readUIntParam("cycle_days", &value) || value < 1 || value > 30) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_cycle\"}");
            return;
        }
        plan.cycleDays = static_cast<uint8_t>(value);
    }
    uint32_t ymd = 0;
    if (readU32Param("cycle_start_ymd", &ymd)) plan.cycleStartYmd = ymd;
    plan.cycleMask = readCycleMaskFromForm(plan.cycleDays);
    if (!PlanStore::set(static_cast<uint8_t>(indexRaw), plan)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_plan\"}");
        return;
    }
    (void)EventStore::append(EventStore::TYPE_PLAN_CHANGED, EventStore::SOURCE_WEB, 0, 0, indexRaw, plan.cycleDays, "plan saved");
    redirectTo("/irrigation/plan-config");
}

void handlePlanSkipApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    char action[16] = "";
    uint32_t ymd = 0;
    if (!Esp32BaseWeb::getParam("action", action, sizeof(action)) || !readU32Param("ymd", &ymd)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_skip_request\"}");
        return;
    }
    bool ok = true;
    if (strcmp(action, "skip_once") == 0 || strcmp(action, "clear_skip") == 0) {
        uint16_t index = 0;
        ok = readUIntParam("index", &index) && index < PlanStore::MaxPlans;
        if (ok) {
            ok = strcmp(action, "skip_once") == 0
                ? PlanSkipStore::setSkipped(static_cast<uint8_t>(index), ymd)
                : PlanSkipStore::clearSkipped(static_cast<uint8_t>(index), ymd);
        }
    } else if (strcmp(action, "skip_day") == 0) {
        char scope[12] = "all";
        (void)Esp32BaseWeb::getParam("scope", scope, sizeof(scope));
        const uint32_t today = currentYmd();
        const bool wantsRemaining = strcmp(scope, "remaining") == 0;
        if (wantsRemaining && today == 0) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"time_not_synced\"}");
            return;
        }
        const bool remaining = wantsRemaining && ymd == today;
        const uint16_t nowMinute = currentMinuteOfDay();
        for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
            const PlanStore::Plan& plan = PlanStore::get(i);
            if (!plan.enabled || !PlanStore::shouldRunOnDate(plan, ymd) || plan.lastRunYmd == ymd) continue;
            if (remaining && plan.minuteOfDay <= nowMinute) continue;
            ok = PlanSkipStore::setSkipped(i, ymd) && ok;
        }
    } else {
        ok = false;
    }
    if (!ok) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"skip_failed\"}");
        return;
    }
    (void)EventStore::append(EventStore::TYPE_PLAN_CHANGED, EventStore::SOURCE_WEB, 0, 0, static_cast<int32_t>(ymd), 0, action);
    redirectTo("/irrigation/plans");
}

void writeRecordJson(const RecordStore::Record& record, void* user) {
    bool* first = static_cast<bool*>(user);
    if (!*first) Esp32BaseWeb::sendChunk(",");
    *first = false;
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(record.id);
    Esp32BaseWeb::sendChunk(",\"session_started_ms\":");
    writeUInt(record.sessionStartedMs);
    Esp32BaseWeb::sendChunk(",\"session_ended_ms\":");
    writeUInt(record.sessionEndedMs);
    Esp32BaseWeb::sendChunk(",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::sourceName(static_cast<RecordStore::Source>(record.source)));
    Esp32BaseWeb::sendChunk("\",\"mode\":\"");
    Esp32BaseWeb::writeJsonEscaped(modeName(static_cast<SettingsStore::ExecutionMode>(record.mode)));
    Esp32BaseWeb::sendChunk("\",\"stop_reason\":\"");
    Esp32BaseWeb::writeJsonEscaped(WateringSession::stopReasonName(static_cast<WateringSession::StopReason>(record.stopReason)));
    Esp32BaseWeb::sendChunk("\",\"enabled_roads\":");
    writeUInt(record.enabledRoads);
    Esp32BaseWeb::sendChunk(",\"flow_no_pulse_timeout_s\":");
    writeUInt(record.flowNoPulseTimeoutSec);
    Esp32BaseWeb::sendChunk(",\"roads\":[");
    for (uint8_t road = 1; road <= 2; ++road) {
        if (road > 1) Esp32BaseWeb::sendChunk(",");
        const RecordStore::RoadRecord& rr = record.roads[road - 1];
        const uint32_t pulses = rr.endedPulseCount >= rr.startedPulseCount ? rr.endedPulseCount - rr.startedPulseCount : 0;
        const uint32_t actualSec = rr.endedMs >= rr.startedMs && rr.startedMs > 0 ? (rr.endedMs - rr.startedMs) / 1000UL : 0;
        Esp32BaseWeb::sendChunk("{\"road\":");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(",\"state\":\"");
        Esp32BaseWeb::writeJsonEscaped(WateringSession::roadStateName(static_cast<WateringSession::RoadState>(rr.state)));
        Esp32BaseWeb::sendChunk("\",\"target_sec\":");
        writeUInt(rr.targetSec);
        Esp32BaseWeb::sendChunk(",\"actual_sec\":");
        writeUInt(actualSec);
        Esp32BaseWeb::sendChunk(",\"started_ms\":");
        writeUInt(rr.startedMs);
        Esp32BaseWeb::sendChunk(",\"ended_ms\":");
        writeUInt(rr.endedMs);
        Esp32BaseWeb::sendChunk(",\"started_pulses\":");
        writeUInt(rr.startedPulseCount);
        Esp32BaseWeb::sendChunk(",\"ended_pulses\":");
        writeUInt(rr.endedPulseCount);
        Esp32BaseWeb::sendChunk(",\"pulses\":");
        writeUInt(pulses);
        Esp32BaseWeb::sendChunk(",\"pulse_per_liter\":");
        writeUInt(rr.pulsePerLiter);
        Esp32BaseWeb::sendChunk(",\"calibration_x1000\":");
        writeUInt(rr.calibrationX1000);
        Esp32BaseWeb::sendChunk(",\"estimated_ml\":");
        writeUInt(rr.estimatedMilliliters);
        Esp32BaseWeb::sendChunk("}");
    }
    Esp32BaseWeb::sendChunk("]}");
}

void handleRecordsApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson();
    Esp32BaseWeb::sendChunk("{\"count\":");
    writeUInt(RecordStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(RecordStore::capacity());
    Esp32BaseWeb::sendChunk(",\"records\":[");
    bool first = true;
    (void)RecordStore::readLatest(0, readLimitParam(20, 50), writeRecordJson, &first);
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handleRecordsCsvApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::beginCsv(200, "irrigation-records.csv")) return;
    Esp32BaseWeb::sendChunk("session_id,source,mode,stop_reason,session_started_ms,session_ended_ms,enabled_roads,flow_no_pulse_timeout_s,road,state,target_sec,actual_sec,road_started_ms,road_ended_ms,pulse_start,pulse_end,pulses,pulse_per_liter,calibration_x1000,estimated_ml\r\n");
    auto cb = [](const RecordStore::Record& record, void*) {
        for (uint8_t road = 1; road <= 2; ++road) {
            const RecordStore::RoadRecord& rr = record.roads[road - 1];
            const uint32_t pulses = rr.endedPulseCount >= rr.startedPulseCount ? rr.endedPulseCount - rr.startedPulseCount : 0;
            const uint32_t actualSec = rr.endedMs >= rr.startedMs && rr.startedMs > 0 ? (rr.endedMs - rr.startedMs) / 1000UL : 0;
            writeUInt(record.id); Esp32BaseWeb::sendChunk(",");
            Esp32BaseWeb::writeCsvEscaped(RecordStore::sourceName(static_cast<RecordStore::Source>(record.source))); Esp32BaseWeb::sendChunk(",");
            Esp32BaseWeb::writeCsvEscaped(modeName(static_cast<SettingsStore::ExecutionMode>(record.mode))); Esp32BaseWeb::sendChunk(",");
            Esp32BaseWeb::writeCsvEscaped(WateringSession::stopReasonName(static_cast<WateringSession::StopReason>(record.stopReason))); Esp32BaseWeb::sendChunk(",");
            writeUInt(record.sessionStartedMs); Esp32BaseWeb::sendChunk(",");
            writeUInt(record.sessionEndedMs); Esp32BaseWeb::sendChunk(",");
            writeUInt(record.enabledRoads); Esp32BaseWeb::sendChunk(",");
            writeUInt(record.flowNoPulseTimeoutSec); Esp32BaseWeb::sendChunk(",");
            writeUInt(road); Esp32BaseWeb::sendChunk(",");
            Esp32BaseWeb::writeCsvEscaped(WateringSession::roadStateName(static_cast<WateringSession::RoadState>(rr.state))); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.targetSec); Esp32BaseWeb::sendChunk(",");
            writeUInt(actualSec); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.startedMs); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.endedMs); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.startedPulseCount); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.endedPulseCount); Esp32BaseWeb::sendChunk(",");
            writeUInt(pulses); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.pulsePerLiter); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.calibrationX1000); Esp32BaseWeb::sendChunk(",");
            writeUInt(rr.estimatedMilliliters); Esp32BaseWeb::sendChunk("\r\n");
        }
    };
    (void)RecordStore::readLatest(0, RecordStore::capacity(), cb, nullptr);
    Esp32BaseWeb::endResponse();
}

